app/controllers/highlights_controller.rb

SELECT * FROM `highlights`
---
  def index
    @highlights = Highlight.all

SELECT * FROM `highlights` WHERE (`highlights`.`id` = 1)
---
  def show
    @highlight = Highlight.find(params[:id])

INSERT INTO `highlights` (`created_at`, `y1`, `x1`, `y2`, `updated_at`, `notes`, `url`, `x2`, `src`, `tiny_url`) VALUES('2009-04-01 22:55:08', NULL, NULL, NULL, '2009-04-01 22:55:08', NULL, 'http://google.com', NULL, NULL, NULL)
---
  def create
    @highlight = Highlight.new(params[:highlight])
    respond_to do |format|
      if @highlight.save